## Question 1: **Answer**

In [1]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connect to the SQLite database
        with sqlite3.connect('revenue_costs.db') as conn:
            cursor = conn.cursor()

           # Create the table
            cursor.execute('''
            CREATE TABLE IF NOT EXISTS sales (
                id INTEGER PRIMARY KEY,
                age INTEGER,
                total_sales REAL,
                total_costs REAL
            )
            ''' )
            # Insert data into the table
            cursor.executemany('''
            INSERT INTO sales (id, age, total_sales, total_costs) VALUES (?, ?, ?, ?)
            ''', [
                (1, 25, 2500.4567,	1500.1234),
                (2, 30, 3000.0000,	2000.0000),
                (3, 35, 2800.1234,	1800.5678),
                (4, 40, 3500.9876,	2200.4321),
                (5, 25, 2700.5000,	1700.3000)
                ]
                )
            conn.commit()
            print("Table created successfully.")
    except Exception as e:
        print(f"Error: {e}")

# Calling the function
add_data_to_database()

Table created successfully.

In [3]:
# Loading SQL extension
%load_ext sql

In [4]:
%sql sqlite:///revenue_costs.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Question 2: **Answer**

In [6]:
%%sql
SELECT
    AVG(age) AS mean_age,
    MIN(age) AS min_age,
    MAX(age) AS max_age
FROM sales;

 * sqlite:///revenue_costs.db
Done.

[(31.0, 25, 40)]

## Question 2: **Answer**

In [7]:
%%sql
SELECT ROUND(total_sales, 2) AS rounded_sales
FROM sales;

 * sqlite:///revenue_costs.db
Done.

[(2500.46,), (3000.0,), (2800.12,), (3500.99,), (2700.5,)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT
    ROUND(total_sales, 1) AS total_sales,
    ROUND(total_costs, 1) AS total_costs,
    ROUND((total_costs / total_sales) * 100,  1)
    AS costs_to_sales_percentage
FROM sales
ORDER BY costs_to_sales_percentage DESC;

 * sqlite:///revenue_costs.db
Done.

[(3000.0, 2000.0, 66.7),
 (2800.1, 1800.6, 64.3),
 (2700.5, 1700.3, 63.0),
 (3501.0, 2200.4, 62.9),
 (2500.5, 1500.1, 60.0)]

## Question 4: **Answer**

In [9]:
%%sql
SELECT
  ROUND(total_sales, 1) AS total_sales,
  ROUND(total_costs, 1) AS total_costs,
  ROUND((total_sales - total_costs), 1) AS profit
FROM sales;

 * sqlite:///revenue_costs.db
Done.

[(2500.5, 1500.1, 1000.3),
 (3000.0, 2000.0, 1000.0),
 (2800.1, 1800.6, 999.6),
 (3501.0, 2200.4, 1300.6),
 (2700.5, 1700.3, 1000.2)]

## Question 5: **Answer**

In [10]:
%%sql
SELECT
    age,
    CAST(total_sales AS INTEGER) AS total_sales,
    CAST(total_costs AS INTEGER) AS total_costs
FROM sales
WHERE total_sales <= 3000 AND total_costs <= 2000;

 * sqlite:///revenue_costs.db
Done.

[(25, 2500, 1500), (30, 3000, 2000), (35, 2800, 1800), (25, 2700, 1700)]